10/data/attachments/7476920e5a2697dd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d439e020-d2e4-47bd-9aac-ecc0b42b9abd</nif:username>
            <nif:friendToBeAdded>Duane_news_Friend_3365_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>